{
  "nodes": [
    {
      "op": "null", 
      "name": "csr_data", 
      "attrs": {"__storage_type__": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "linear_weight", 
      "attrs": {
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__shape__": "(3000, 2)", 
        "__storage_type__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot0", 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "linear_bias", 
      "attrs": {"__shape__": "(2,)"}, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dns_data", 
      "inputs": []
    }, 
    {
      "op": "slice", 
      "name": "slice1", 
      "attrs": {
        "begin": "(0, 2)", 
        "end": "(None, 40)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice0", 
      "attrs": {
        "begin": "(0, 0)", 
        "end": "(None, 2)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attrs": {
        "num_outputs": "2", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "embed_0_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "_contrib_SparseEmbedding", 
      "name": "sparseembedding0", 
      "attrs": {
        "input_dim": "1000", 
        "output_dim": "8"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "embed_1_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "_contrib_SparseEmbedding", 
      "name": "sparseembedding1", 
      "attrs": {
        "input_dim": "1000", 
        "output_dim": "8"
      }, 
      "inputs": [[8, 1, 0], [11, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[6, 0, 0], [10, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_weight", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_bias", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_weight", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_bias", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected1", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_weight", 
      "attrs": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_bias", 
      "attrs": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected2", 
      "attrs": {"num_hidden": "2"}, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[4, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "model", 
      "inputs": [[25, 0, 0], [26, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    5, 
    9, 
    11, 
    14, 
    15, 
    18, 
    19, 
    22, 
    23, 
    26
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29
  ], 
  "heads": [[27, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10000]}
}